⚙️ Используемые библиотеки
  - aiogram — для создания Telegram-бота (работа с сообщениями, командами)
  - apscheduler — для автоматического обновления данных по расписанию
  - requests — для получения данных с API (например, курсы, погода и т.д.)
  - pandas — для обработки и анализа данных
  - matplotlib и mplfinance — для построения графиков
  - datetime — для работы с датами и временем
  - io / BufferedInputFile — для отправки графиков и файлов пользователю
  - telebot — альтернативная библиотека для Telegram (используется вместе с aiogram в некоторых функциях)
  - json — для обработки данных в формате JSON (например, API-ответов)

 📌Для установки pip install aiogram apscheduler requests pandas matplotlib mplfinance telebot, (остальные уже есть в самом питоне)

